# Pandas 索引

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(np.arange(5),index = np.arange(5)[::-1],dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

### 查看当前数据是否在一个列表中
* .isin([ ])

In [3]:
s.isin([1,3,4])  
#通过isin找出索引

4    False
3     True
2    False
1     True
0     True
dtype: bool

In [4]:
# 再将索引回传，取出值
s[s.isin([1,3,4])]

3    1
1    3
0    4
dtype: int64

### 定位多重索引

In [5]:
#构建多重索引 .MultiIndex.from_product()
s2 = pd.Series(np.arange(6),index = pd.MultiIndex.from_product([[0,1],['a','b','c']]))
s2

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [6]:
s2.iloc[s2.index.isin([(1,'a'),(0,'b')])]

0  b    1
1  a    3
dtype: int32

In [7]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [9]:
s[s>2] #相当于where操作

1    3
0    4
dtype: int64

In [12]:
dates = pd.date_range('20180415',periods=8) #构造八天的数据
df = pd.DataFrame(np.random.randn(8,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2018-04-15 -0.034083  0.112461 -0.194380 -0.456091
2018-04-16  0.801105  1.694559  2.110274  1.023470
2018-04-17 -0.328700 -1.041093 -0.078021 -0.840678
2018-04-18  0.086604  0.029078 -0.402031  0.420123
2018-04-19 -1.199706 -0.219881  0.830302 -2.041555
2018-04-20 -0.493454 -0.825598  0.092869 -1.252545
2018-04-21 -0.313113  1.111081  0.206693  1.095744
2018-04-22 -1.152653  1.483222  0.058826 -0.899564

In [13]:
df.select(lambda x:x=='A',axis='columns') #这种操作过于麻烦

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'select' is deprecated and will be removed in a future release. You can use .loc[labels.map(crit)] as a replacement
  """Entry point for launching an IPython kernel.

                   A
2018-04-15 -0.034083
2018-04-16  0.801105
2018-04-17 -0.328700
2018-04-18  0.086604
2018-04-19 -1.199706
2018-04-20 -0.493454
2018-04-21 -0.313113
2018-04-22 -1.152653

### 找出特定(如：df<0)的值
* df.where()

In [14]:
df.where(df < 0) 
#这种的做法的缺点是不满足条件的话就会赋值NaN

                   A         B         C         D
2018-04-15 -0.034083       NaN -0.194380 -0.456091
2018-04-16       NaN       NaN       NaN       NaN
2018-04-17 -0.328700 -1.041093 -0.078021 -0.840678
2018-04-18       NaN       NaN -0.402031       NaN
2018-04-19 -1.199706 -0.219881       NaN -2.041555
2018-04-20 -0.493454 -0.825598       NaN -1.252545
2018-04-21 -0.313113       NaN       NaN       NaN
2018-04-22 -1.152653       NaN       NaN -0.899564

In [19]:
df.where(df < 0,0)
#这种的做法弥补了上述做法的缺点，可以为不满足条件的值赋值为0(满足条件的不变)

                   A         B         C         D
2018-04-15 -0.034083  0.000000 -0.194380 -0.456091
2018-04-16  0.000000  0.000000  0.000000  0.000000
2018-04-17 -0.328700 -1.041093 -0.078021 -0.840678
2018-04-18  0.000000  0.000000 -0.402031  0.000000
2018-04-19 -1.199706 -0.219881  0.000000 -2.041555
2018-04-20 -0.493454 -0.825598  0.000000 -1.252545
2018-04-21 -0.313113  0.000000  0.000000  0.000000
2018-04-22 -1.152653  0.000000  0.000000 -0.899564

In [22]:
df.where(df < 0,999) #不满足条件的值赋值为999(满足条件的不变)

                     A           B           C           D
2018-04-15   -0.034083  999.000000   -0.194380   -0.456091
2018-04-16  999.000000  999.000000  999.000000  999.000000
2018-04-17   -0.328700   -1.041093   -0.078021   -0.840678
2018-04-18  999.000000  999.000000   -0.402031  999.000000
2018-04-19   -1.199706   -0.219881  999.000000   -2.041555
2018-04-20   -0.493454   -0.825598  999.000000   -1.252545
2018-04-21   -0.313113  999.000000  999.000000  999.000000
2018-04-22   -1.152653  999.000000  999.000000   -0.899564

### 查找操作
* .query()

In [23]:
df = pd.DataFrame(np.random.rand(10,3),columns = list('abc'))
df

          a         b         c
0  0.491445  0.764831  0.021088
1  0.624962  0.315393  0.348886
2  0.516669  0.448851  0.042526
3  0.641538  0.802660  0.545935
4  0.010836  0.749341  0.896280
5  0.168260  0.849380  0.725711
6  0.777565  0.047756  0.413950
7  0.997958  0.047085  0.630303
8  0.664029  0.934964  0.443267
9  0.274064  0.826807  0.580339

In [25]:
df.query('(a<b)')  #找出a<b的所有值

          a         b         c
0  0.491445  0.764831  0.021088
3  0.641538  0.802660  0.545935
4  0.010836  0.749341  0.896280
5  0.168260  0.849380  0.725711
8  0.664029  0.934964  0.443267
9  0.274064  0.826807  0.580339

In [27]:
df.query('(a<b) & (b<c)')  #找出a<b 且 b<c的所有值

          a         b        c
4  0.010836  0.749341  0.89628